# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 6, C2f, [128, True]]
  - [-1, 1, MPCA, []] # 3
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 9, C2f, [256, True]]
  - [-1, 1, MPCA, []] # 6
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 9, C2f, [512, True]]
  - [-1, 1, MPCA, []] # 9
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 6, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 12

# YOLOv8.0-p2 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[2, 5, 9, 13], 1, Fusion4, []] # 13
  - [-1, 3, DCN_M, [512]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, DCN_M, [256]] # 18 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-1, 1, DTM, [256]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P2 21
  - [-1, 6, DCN_M, [128]] # 22 (P2/4-xsmall)

  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, DTM, [128]]
  - [[-1, 18], 1, Concat, [1]] # cat head P3 25
  - [-1, 6, DCN_M, [256]] # 26 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, DTM, [256]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4 29
  - [-1, 3, DCN_M, [512]] # 30 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 1, DTM, [512]]
  - [[-1, 12], 1, Concat, [1]] # cat head P5 33
  - [-1, 3, DCN_M, [1024]] # 34 (P5/32-large)

  - [[22, 26, 30, 34], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
